Tekla Open API Reference for Tekla Structures 2025
DatabaseObject.GetStringUserProperties Method
Overload List
Name | Description
GetStringUserProperties(Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
GetStringUserProperties(List<String>, Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
Top
See Also
Reference
DatabaseObject Class
Tekla.Structures.Drawing Namespace